package Labs;
//Односвязный список
//        1) Реализовать класс Element && класс List для хранения данных типа int.
//        2) в классе List реализовать метод addElement() - добавление элемента в начало списка.
//        3) в классе List реализовать метод getSize () - возвращает размер списка. Нужно сделать так,
//        чтобы при вызове этого метода он возвращал одно закешированное значение.
//        Не нужно чтобы метод проходил по всему списку.
//        4) в классе List реализовать метод remove() - удаление первого элемента списка и возвращение
//        этого значения в качестве результата работы метода.
//        Проверить работу этого метода в совокупности с методом add()
//        Запрещено использовать массивы и другие коллекции объектов.

//not completed
public class lab14_List {
    public static void main(String[] args) {

    }
}

class Element {

}

class List {
   void addElement (){


   }
   void getSize (){

   }
   void remove (){

   }
}
